---
layout: post
toc: true
title: Amazon RDS
categories: [AP CSA]
courses: { csa: {week: 17} }
author: Arthur, Nikhil, Aditya
permalink: /period3/frq/database/sql
---

# SQLite

SQLite is a lightweight, serverless **database** stored in a single file. It follows SQL standards, and can be used in a variety of applications.

## Creating a New Table

```
CREATE TABLE table_name (
    column1 type, 
    column2 type, 
    column3 type
);
```
### Example data types in SQL:
```
VARCHAR
INTEGER
FLOAT
```
[More Example Types](https://www.geeksforgeeks.org/sql-data-types/)

## Deleting Tables

```
DROP TABLE <table name>;
```

## Populating Tables
```
INSERT INTO table_name
VALUES ('John', 92, A, 14)
```
or
```
INSERT INTO table_name (name, score, grade, age)
VALUES ('John', 92, A, 14)
```

## Querying

### Selecting all rows from a table:
```
SELECT *
FROM table_name;
```

You can also specify specific columns to query as well by replacing the * with column names

```
SELECT name, (score-10) as late_score, age
FROM table_name;
```

More advanced queries can also be created:
```
SELECT *
FROM table_name
WHERE grade = 'A'
AND age = 14;
```

In [12]:
%pip install --upgrade prettytable

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: prettytable in /home/nikhil/.local/lib/python3.10/site-packages (3.13.0)
Collecting prettytable
  Downloading prettytable-3.14.0-py3-none-any.whl (31 kB)
Requirement already satisfied: wcwidth in /usr/lib/python3/dist-packages (from prettytable) (0.2.5)
Installing collected packages: prettytable
  Attempting uninstall: prettytable
    Found existing installation: prettytable 3.13.0
    Uninstalling prettytable-3.13.0:
      Successfully uninstalled prettytable-3.13.0
Successfully installed prettytable-3.14.0
Note: you may need to restart the kernel to use updated packages.

In [10]:
# %pip install ipython-sql
# %pip install pandas

import pandas as pd
import sqlite3

students = pd.DataFrame({
    'student_name': ['John', 'Jane', 'Alice', 'Bob', 'Charlie'],
    'age': [14, 15, 14, 16, 15],
    'assignment_grade': [85.5, 90.0, 88.0, 92.5, 87.0]
})

# Set an available style explicitly
%config SqlMagic.style = "DEFAULT"


students

  student_name  age  assignment_grade
0         John   14              85.5
1         Jane   15              90.0
2        Alice   14              88.0
3          Bob   16              92.5
4      Charlie   15              87.0

In [2]:
conn = sqlite3.connect('mydatabase.db')

In [3]:
students.to_sql('students', conn)

ValueError: Table 'students' already exists.

In [4]:
%reload_ext sql

In [5]:
# Connect to the SQLite database
%sql sqlite:///mydatabase.db

In [6]:
%%sql
CREATE TABLE students (
    student_name VARCHAR,
    age INTEGER,
    assignment_grade FLOAT
);

 * sqlite:///mydatabase.db
(sqlite3.OperationalError) table students already exists
[SQL: CREATE TABLE students (
    student_name VARCHAR,
    age INTEGER,
    assignment_grade FLOAT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [7]:
%%sql
INSERT INTO students (student_name, age, assignment_grade) 
VALUES ('Tommy', 14, 85.5);

 * sqlite:///mydatabase.db
1 rows affected.

[]

In [11]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [12]:
%%sql
SELECT * FROM students

 * sqlite:///mydatabase.db
Done.

[(0, 'John', 14, 85.5),
 (1, 'Jane', 15, 90.0),
 (2, 'Alice', 14, 88.0),
 (3, 'Bob', 16, 92.5),
 (4, 'Charlie', 15, 87.0),
 (None, 'Tommy', 14, 85.5),
 (None, 'Tommy', 14, 85.5),
 (None, 'Tommy', 14, 85.5)]